CSI API ETABS v1
cTower.AddCopyOfTower Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int AddCopyOfTower(
	string TowerName,
	string NewTowerName
)
Function AddCopyOfTower (
	TowerName As String,
	NewTowerName As String
) As Integer
Dim instance As cTower
Dim TowerName As String
Dim NewTowerName As String
Dim returnValue As Integer
returnValue = instance.AddCopyOfTower(TowerName,
	NewTowerName)
int AddCopyOfTower(
	String^ TowerName,
	String^ NewTowerName
)
abstract AddCopyOfTower :
        TowerName : string *
        NewTowerName : string -> int
Parameters
TowerName
Type: System.String
NewTowerName
Type: System.String
Return Value
Type: Int32
See Also
Reference
cTower Interface
ETABSv1 Namespace